In [1]:
import sqlite3
import pandas as pd

In [15]:
conn = sqlite3.connect('mean_green.db')

In [16]:
ls

barbershop.db               insert_ingredients.sql
create_employees.sql        mean_green.db
create_employees_salad.sql  python-and-sql.ipynb
create_ingredients.sql      saladshop.db
insert_employees_salad.sql

In [17]:
cursor = conn.cursor()

In [11]:
sql = """CREATE TABLE employees (
    name TEXT,
    zipcode TEXT
);"""

In [12]:
cursor.execute(sql)

OperationalError: table employees already exists

In [ ]:
conn.commit()

In [18]:
cursor.execute('select * from employees;')

In [19]:
cursor.fetchall()

[]

# saladshop.db

In [20]:
import pandas as pd
employees_url = "https://raw.githubusercontent.com/eng-6-22/mod-1-sql-curriculum/master/1-sql-fundamentals/6-python-sql-lab/employees.csv"
employees_df = pd.read_csv(employees_url)
ingredients_url = "https://raw.githubusercontent.com/eng-6-22/mod-1-sql-curriculum/master/1-sql-fundamentals/6-python-sql-lab/ingredients.csv"
ingredients_df = pd.read_csv(ingredients_url)

In [25]:
employees_df.head(2)

   id    name     position  start_date  zip_code  phone_number
0   1     Tom      manager  2019-05-20     10001  212-438-3984
1   2  Alison  salad maker  2020-01-04     10023  212-329-2489

In [26]:
ingredients_df.head(2)

   id          name  cost_per_ounce  calories_per_ounce  expiration
0   1  baby spinach            0.19                   7  2020-02-05
1   2          kale            0.50                  10  2020-02-10

In [32]:
import sqlite3
conn = sqlite3.connect('./saladshop.db')
cursor = conn.cursor()

In [42]:
employees_df.to_sql('employees', conn, index = False)
ingredients_df.to_sql('ingredients', conn, index = False)

5

In [43]:
statement = 'select * from ingredients;'
cursor.execute(statement)
cursor.fetchall()

[(1, 'baby spinach', 0.19, 7, '2020-02-05'),
 (2, 'kale', 0.5, 10, '2020-02-10'),
 (3, 'tomatoes', 1.25, 5, '2020-01-30'),
 (4, 'broccoli', 1.15, 45, '2020-02-10'),
 (5, 'chicken', 3.5, 60, '2020-02-07')]

In [44]:
statement = 'select * from employees;'

cursor.execute(statement)
cursor.fetchall()

[(1, 'Tom', 'manager', '2019-05-20', 10001, '212-438-3984'),
 (2, 'Alison', 'salad maker', '2020-01-04', 10023, '212-329-2489'),
 (3, 'Jerry', 'delivery driver', '2019-12-15', 10001, '212-219-1029'),
 (4, 'Brian', 'salad maker', '2019-12-04', 10002, '646-328-2309'),
 (5, 'Vanessa', 'clerk', '2019-11-14', 11201, '718-348-2348')]

# working on grocery.db

In [57]:
conn = sqlite3.connect('./grocery.db')
cursor = conn.cursor()

employees_url = "https://raw.githubusercontent.com/eng-6-22/mod-1-sql-curriculum/master/sql-select-lab/data/employees.csv"
ingredients_url = "https://raw.githubusercontent.com/eng-6-22/mod-1-sql-curriculum/master/sql-select-lab/data/ingredients.csv"
ingredients_df = pd.read_csv(ingredients_url)
employees_df = pd.read_csv(employees_url)

In [58]:
ingredients_df.to_sql('ingredients', conn,
                  index = False, if_exists = 'replace')
employees_df.to_sql('employees', conn, index = False,
        if_exists = 'replace')

12

In [59]:
print(len(ingredients_df))
print(len(employees_df))

20
12

In [60]:
statement = 'select * from employees;'
def run_query(conn, statement):
    cursor = conn.cursor()
    cursor.execute(statement)
    return cursor.fetchall()
    
run_query(conn, statement)

[(1, 'Tom', 'manager', '2019-05-20', 10001, '212-438-3984'),
 (2, 'Alison', 'salad maker', '2020-01-04', 10023, '212-329-2489'),
 (3, 'Jerry', 'delivery driver', '2019-12-15', 10001, '212-219-1029'),
 (4, 'Brian', 'salad maker', '2019-12-04', 10002, '646-328-2309'),
 (5, 'Vanessa', 'clerk', '2019-11-14', 11201, '718-348-2348'),
 (6, 'Cindy', 'assistant manager', '2019-11-12', 10002, '212-300-1203'),
 (7, 'Charles', 'delivery driver', '2020-01-02', 10003, '212-993-2348'),
 (8, 'Alex', 'assistant manager', '2019-06-11', 10001, '718-293-1823'),
 (9, 'Naomi', 'manager', '2019-02-12', 10002, '212-493-2922'),
 (10, 'Isabel', 'salad maker', '2020-01-04', 10001, '212-390-9122'),
 (11, 'James', 'clerk', '2020-01-10', 10023, '718-645-2929'),
 (12, 'Max', 'salad maker', '2019-10-03', 10002, '212-555-2911')]

In [65]:
# run all employment

def all_employees(conn, statement):
    return run_query(conn, statment)
    
statement = 'select * from employees;'
all_employees(conn, statement)

[(1, 'Tom', 'manager', '2019-05-20', 10001, '212-438-3984'),
 (2, 'Alison', 'salad maker', '2020-01-04', 10023, '212-329-2489'),
 (3, 'Jerry', 'delivery driver', '2019-12-15', 10001, '212-219-1029'),
 (4, 'Brian', 'salad maker', '2019-12-04', 10002, '646-328-2309'),
 (5, 'Vanessa', 'clerk', '2019-11-14', 11201, '718-348-2348'),
 (6, 'Cindy', 'assistant manager', '2019-11-12', 10002, '212-300-1203'),
 (7, 'Charles', 'delivery driver', '2020-01-02', 10003, '212-993-2348'),
 (8, 'Alex', 'assistant manager', '2019-06-11', 10001, '718-293-1823'),
 (9, 'Naomi', 'manager', '2019-02-12', 10002, '212-493-2922'),
 (10, 'Isabel', 'salad maker', '2020-01-04', 10001, '212-390-9122'),
 (11, 'James', 'clerk', '2020-01-10', 10023, '718-645-2929'),
 (12, 'Max', 'salad maker', '2019-10-03', 10002, '212-555-2911')]

In [66]:
len(all_employees(conn, statement)) == 12

True

In [70]:
def all_ingredients(conn, statement):
    return run_query(conn, statement)


statement = 'select * from ingredients;'
all_ingredients(conn, statement)

[(1, 'baby spinach', 0.19, 7, '2020-02-05'),
 (2, 'kale', 0.5, 10, '2020-02-10'),
 (3, 'tomatoes', 1.25, 5, '2020-01-30'),
 (4, 'broccoli', 1.15, 45, '2020-02-10'),
 (5, 'chicken', 3.5, 90, '2020-02-07'),
 (6, 'arugula', 0.5, 20, '2020-02-10'),
 (7, 'apples', 1.2, 30, '2020-02-08'),
 (8, 'pears', 1.1, 30, '2020-02-10'),
 (9, 'corn', 1.25, 40, '2020-02-08'),
 (10, 'brussels sprouts', 1.4, 40, '2020-02-01'),
 (11, 'almonds', 0.9, 50, '2020-02-02'),
 (12, 'mushrooms', 1.4, 60, '2020-02-02'),
 (13, 'tofu', 1.35, 40, '2020-02-03'),
 (14, 'avocado', 2.05, 70, '2020-02-08'),
 (15, 'romaine', 0.2, 5, '2020-02-07'),
 (16, 'cauliflower', 1.6, 45, '2020-01-30'),
 (17, 'parmesan', 2.1, 75, '2020-02-01'),
 (18, 'feta', 2.2, 80, '2020-02-02'),
 (19, 'caesar dressing', 1.5, 90, '2020-02-03'),
 (20, 'balsamic vinaigrette', 1.45, 40, '2020-02-07')]

In [71]:
len(all_ingredients(conn, statement)) == 20

True

In [72]:
def all_ingredient_names(conn, statement):
    return run_query(conn, statement)


statement = 'select name from ingredients;'
all_ingredients(conn, statement)

[('baby spinach',),
 ('kale',),
 ('tomatoes',),
 ('broccoli',),
 ('chicken',),
 ('arugula',),
 ('apples',),
 ('pears',),
 ('corn',),
 ('brussels sprouts',),
 ('almonds',),
 ('mushrooms',),
 ('tofu',),
 ('avocado',),
 ('romaine',),
 ('cauliflower',),
 ('parmesan',),
 ('feta',),
 ('caesar dressing',),
 ('balsamic vinaigrette',)]

In [73]:
len(all_ingredient_names(conn, statement)) == 20

True

In [74]:
def all_employee_start_dates(conn, statement):
    return run_query(conn, statement)


statement = 'select start_date from employees;'
all_employee_start_dates(conn, statement)

[('2019-05-20',),
 ('2020-01-04',),
 ('2019-12-15',),
 ('2019-12-04',),
 ('2019-11-14',),
 ('2019-11-12',),
 ('2020-01-02',),
 ('2019-06-11',),
 ('2019-02-12',),
 ('2020-01-04',),
 ('2020-01-10',),
 ('2019-10-03',)]

In [75]:
len(all_employee_start_dates(conn, statement)) == 12

True

In [77]:
def cheaper_ingredients(conn, statement):
    return run_query(conn, statement)


statement = 'select * from ingredients where cost_per_ounce < 1.0;'
cheaper_ingredients(conn, statement)

[(1, 'baby spinach', 0.19, 7, '2020-02-05'),
 (2, 'kale', 0.5, 10, '2020-02-10'),
 (6, 'arugula', 0.5, 20, '2020-02-10'),
 (11, 'almonds', 0.9, 50, '2020-02-02'),
 (15, 'romaine', 0.2, 5, '2020-02-07')]

In [89]:
def naomi_start_date(conn, statement):
    return run_query(conn, statement)


statement = """select start_date from employees where name = 'Naomi';"""
naomi_start_date(conn, statement)

[('2019-02-12',)]

In [91]:
naomi_start_date(conn, statement) == [('2019-02-12',)]

True

In [99]:
def ingredients_expiring_after_feb(conn, statement):
    return run_query(conn, statement)


statement = """select * from ingredients where expiration > '2020-02-03';"""
ingredients_expiring_after_feb(conn, statement)

[(1, 'baby spinach', 0.19, 7, '2020-02-05'),
 (2, 'kale', 0.5, 10, '2020-02-10'),
 (4, 'broccoli', 1.15, 45, '2020-02-10'),
 (5, 'chicken', 3.5, 90, '2020-02-07'),
 (6, 'arugula', 0.5, 20, '2020-02-10'),
 (7, 'apples', 1.2, 30, '2020-02-08'),
 (8, 'pears', 1.1, 30, '2020-02-10'),
 (9, 'corn', 1.25, 40, '2020-02-08'),
 (14, 'avocado', 2.05, 70, '2020-02-08'),
 (15, 'romaine', 0.2, 5, '2020-02-07'),
 (20, 'balsamic vinaigrette', 1.45, 40, '2020-02-07')]

In [103]:
def ingredients_middle_price(conn, statement):
    return run_query(conn, statement)


statement = """select * from ingredients where  1.0 > cost_per_ounce < 1.5 ;"""
ingredients_middle_price(conn, statement)

[(1, 'baby spinach', 0.19, 7, '2020-02-05'),
 (2, 'kale', 0.5, 10, '2020-02-10'),
 (3, 'tomatoes', 1.25, 5, '2020-01-30'),
 (4, 'broccoli', 1.15, 45, '2020-02-10'),
 (5, 'chicken', 3.5, 90, '2020-02-07'),
 (6, 'arugula', 0.5, 20, '2020-02-10'),
 (7, 'apples', 1.2, 30, '2020-02-08'),
 (8, 'pears', 1.1, 30, '2020-02-10'),
 (9, 'corn', 1.25, 40, '2020-02-08'),
 (10, 'brussels sprouts', 1.4, 40, '2020-02-01'),
 (11, 'almonds', 0.9, 50, '2020-02-02'),
 (12, 'mushrooms', 1.4, 60, '2020-02-02'),
 (13, 'tofu', 1.35, 40, '2020-02-03'),
 (14, 'avocado', 2.05, 70, '2020-02-08'),
 (15, 'romaine', 0.2, 5, '2020-02-07'),
 (16, 'cauliflower', 1.6, 45, '2020-01-30'),
 (17, 'parmesan', 2.1, 75, '2020-02-01'),
 (18, 'feta', 2.2, 80, '2020-02-02'),
 (19, 'caesar dressing', 1.5, 90, '2020-02-03'),
 (20, 'balsamic vinaigrette', 1.45, 40, '2020-02-07')]

In [105]:
all([(ingredient[2] < 1.50 or ingredient[2] > 1) for ingredient in ingredients_middle_price(conn, statement)])

True

In [109]:
def employees_in_nearby_zip_code(conn, statement):
    return run_query(conn, statement)


statement = """select * from employees where  zip_code IN (10001, 10002) ;"""
employees_in_nearby_zip_code(conn, statement)

[(1, 'Tom', 'manager', '2019-05-20', 10001, '212-438-3984'),
 (3, 'Jerry', 'delivery driver', '2019-12-15', 10001, '212-219-1029'),
 (4, 'Brian', 'salad maker', '2019-12-04', 10002, '646-328-2309'),
 (6, 'Cindy', 'assistant manager', '2019-11-12', 10002, '212-300-1203'),
 (8, 'Alex', 'assistant manager', '2019-06-11', 10001, '718-293-1823'),
 (9, 'Naomi', 'manager', '2019-02-12', 10002, '212-493-2922'),
 (10, 'Isabel', 'salad maker', '2020-01-04', 10001, '212-390-9122'),
 (12, 'Max', 'salad maker', '2019-10-03', 10002, '212-555-2911')]

In [111]:
all([(employee[-2] == 10001 or employee[-2] == 10002) for employee in employees_in_nearby_zip_code(conn, statement)])

True

# Belongs To High School Data

Improving your Python code and SQL queries can be done in several ways, including refactoring for better readability, performance, and maintainability, as well as adding comprehensive docstrings and comments. Here's a list of improvements for your code:

1. Use Context Managers for Database Connections:
Using with statements ensures that resources are properly managed and the database connection is closed automatically, even if an error occurs.

2. Separate Concerns:
Break your code into functions, each handling a specific task. This makes your code more readable and reusable.

3. Add Docstrings:
Write docstrings for each function to explain what it does, its parameters, and what it returns.

4. Error Handling:
Add error handling to manage any potential exceptions that may occur during database operations.

5. Use Parameterized Queries:
Avoid SQL injection and errors by using parameterized queries instead of string formatting.

6. Code Comments:
Add comments to complex parts of the code to explain the intent and logic.

7. Consistent Naming Conventions:
Use consistent and descriptive variable and function names.

8. Remove Redundant Code:
If you have any code that is not used or could be simplified, remove or refactor it.

9. Optimize SQL Queries:
Ensure that your SQL queries are efficient and well-structured. Use JOINs instead of subqueries where appropriate, and index your tables.

10. Data Handling:
Consider the size of the data. If the datasets are large, you might want to process them in chunks.


### Python Code Refactoring and Docstring

1. Use Context Managers for Database Connections: This ensures that the connection is properly closed even if an error occurs, which is a best practice for managing resources.

2. Function Decomposition: Break down your code into functions, each performing a single responsibility. This makes your code more readable, maintainable, and testable.

3. Docstrings: Add docstrings to your functions to explain what they do, their parameters, and what they return.

4. Error Handling: Add try-except blocks to handle potential errors, such as connection issues or SQL errors.

5. Constants: Define URLs and database paths as constants at the top of your script.

6. Type Annotations: Use type annotations to indicate the expected types of function arguments and return values.

In [5]:
import sqlite3
import pandas as pd

def db_connection(db_path:str):
    """
    Creates a connection and a cursor to the SQLite database.

    Parameters:
    db_path (str): Path to the SQLite database file.

    Returns:
    tuple: A tuple containing the connection and cursor to the database.
    """
    conn = sqlite3.connect(db_path)
    cursor = conn.cursor()
    return conn, cursor

def load_data_to_sqlite(db_path: str, data_url: str, table_name: str) -> None:
    """
    Loads data from a CSV URL into an SQLite table.
    """
    conn, cursor = db_connection(db_path)
    df = pd.read_csv(data_url)
    df.to_sql(table_name, conn, index=False, if_exists='replace')
    conn.close()
        
def get_table_names(db_path: str) -> list[type]:
    """
    Retrieves a list of all table names in the SQLite database.
    """
    conn, cursor = db_connection(db_path)
    cursor.execute('SELECT name from sqlite_master where type="table"')
    tables = cursor.fetchall()
    conn.close()
    return tables      

def get_table_info(db_path:str, table_name: str) -> list[type]:
    """
    Retrieves the schema information of a given table.
    """
    conn, cursor = db_connection(db_path)
    cursor.execute(f'PRAGMA table_info({table_name})')
    info = cursor.fetchall()
    conn.close()
    return info

def run_query(db_path: str, statement: str) -> list[type]:
    """
    Executes a SQL statement and returns the results.
    """
    conn, cursor = db_connection(db_path)
    cursor.execute(statement)
    results = cursor.fetchall()
    conn.close()
    return results

In [22]:
# Constants
db_path = 'schools.db'
highschools_url = "https://raw.githubusercontent.com/sql-fundamentals-jigsaw/mod-1-sql-curriculum/master/2-sql-relations/2-belongs-to-hs/data/highschools.csv"
sat_records_url = "https://raw.githubusercontent.com/sql-fundamentals-jigsaw/mod-1-sql-curriculum/master/2-sql-relations/2-belongs-to-hs/data/sat_records.csv"

# load data in sqlite3 - 'schools.db'
load_data_to_sqlite(db_path, highschools_url, 'high_schools')
load_data_to_sqlite(db_path, sat_records_url, 'sat_records')

In [23]:
get_table_names(db_path)

[('high_schools',), ('sat_records',)]

In [24]:
 get_table_info(db_path, table_name ='high_schools')

[(0, 'id', 'INTEGER', 0, None, 0),
 (1, 'dbn', 'TEXT', 0, None, 0),
 (2, 'school_name', 'TEXT', 0, None, 0),
 (3, 'boro', 'TEXT', 0, None, 0),
 (4, 'total_students', 'INTEGER', 0, None, 0),
 (5, 'graduation_rate', 'REAL', 0, None, 0),
 (6, 'attendance_rate', 'REAL', 0, None, 0),
 (7, 'college_career_rate', 'REAL', 0, None, 0)]

In [25]:
statement ="""
SELECT DISTINCT boro FROM high_schools LIMIT 10
"""
run_query(db_path, statement)

[('K',), ('M',), ('Q',), ('X',), ('R',)]

Each of the following questions require information in both of the tables in the database. Use the JOIN clause to find the solution.

In [27]:
# In which boro is the school that has the highest writing score?

statement = """
SELECT 
  high_schools.boro,
  max(sat_records.writing_score)
FROM 
  high_schools
JOIN sat_records 
    ON high_schools.dbn = sat_records.dbn
GROUP BY 
  high_schools.boro
ORDER BY 
  max(writing_score) desc
LIMIT 1
"""

run_query(db_path, statement)

[('M', 682.0)]

In [28]:
# In which boro is the school with the lowest math average?

statement = """
SELECT 
  high_schools.boro,
  min(sat_records.math_avg)
FROM 
  high_schools
JOIN sat_records 
    ON high_schools.dbn = sat_records.dbn
GROUP BY 
  high_schools.boro
ORDER BY 
  min(sat_records.math_avg)
LIMIT 1
"""
run_query(db_path, statement)

[('X', 312.0)]

In [29]:
# What is the highest math_avg for schools with more than 1000 students?

statement = """
SELECT 
  high_schools.dbn, 
  max(sat_records.math_avg) 
FROM 
    sat_records
JOIN high_schools 
    on sat_records.dbn = high_schools.dbn
GROUP BY
    high_schools.dbn
HAVING 
    total_students > 1000
ORDER BY 
    max(sat_records.math_avg) desc
LIMIT 1
"""

run_query(db_path, statement)

[('02M475', 735.0)]

In [30]:
# What is the average number of test takers in each boro?

statement = """
select 
  high_schools.boro, 
  avg(sat_records.num_test_takers) 
from sat_records
join high_schools 
  on sat_records.dbn = high_schools.dbn
group by 
  high_schools.boro
order by 
  max(sat_records.num_test_takers) desc
"""

run_query(db_path, statement)

[('K', 126.33673469387755),
 ('Q', 199.51666666666668),
 ('M', 110.34177215189874),
 ('R', 300.5),
 ('X', 80.3875)]

In [31]:
# What is the attendance rate of schools with math_avg greater than 500? Order your results by the attendance rate (descending) limit to the first five results

statement = """
SELECT 
  high_schools.attendance_rate
FROM sat_records
JOIN high_schools 
  on sat_records.dbn = high_schools.dbn
WHERE math_avg > 500 
ORDER BY 
  high_schools.attendance_rate desc
LIMIT 5
"""

run_query(db_path, statement)

[(0.98,), (0.97,), (0.97,), (0.97,), (0.97,)]

In [32]:
# What is the graduation rate of schools with a math_avg less than 500? Order your results by the graduation rate (ascending) limit to ten results

statement = """
select 
  high_schools.graduation_rate
from sat_records
join high_schools 
  on sat_records.dbn = high_schools.dbn
where math_avg < 500 
order by 
  high_schools.graduation_rate
limit 10
"""

run_query(db_path, statement)

[(None,),
 (None,),
 (None,),
 (None,),
 (0.39,),
 (0.46,),
 (0.47,),
 (0.49,),
 (0.5,),
 (0.5,)]

In [33]:
# For schools with a math avg greater than 500, what is the average graduation rate?

statement = """
select 
  avg(high_schools.graduation_rate)
from sat_records
join high_schools 
  on sat_records.dbn = high_schools.dbn
where math_avg > 500
"""

run_query(db_path, statement)

[(0.9769999999999999,)]

In [34]:
# What is the total number of test takers in each boro?

statement = """
select 
  high_schools.boro, 
  sum(sat_records.num_test_takers) 
from sat_records
join high_schools 
  on sat_records.dbn = high_schools.dbn
group by 
  high_schools.boro
"""

run_query(db_path, statement)

[('K', 12381.0), ('M', 8717.0), ('Q', 11971.0), ('R', 3005.0), ('X', 6431.0)]

In [35]:
# What is the average combined reading and math scores for each boro?

statement = """
select 
  boro,
  avg(sat_records.reading_avg + sat_records.math_avg) 
from sat_records
join high_schools 
  on sat_records.dbn = high_schools.dbn
Group by 
  boro
"""
run_query(db_path, statement)

[('K', 795.2857142857143),
 ('M', 869.5822784810126),
 ('Q', 874.5666666666667),
 ('R', 930.0),
 ('X', 778.2375)]

In [36]:
# Find the top five schools that have the largest differences between num_test_takers and total_students

statement = """
select 
  name,
  max(high_schools.total_students - sat_records.num_test_takers ) 
from sat_records
join high_schools 
  on sat_records.dbn = high_schools.dbn
Group by 
  sat_records.dbn
order by 
  max(high_schools.total_students - sat_records.num_test_takers ) desc
limit 5
"""
run_query(db_path, statement)

[('BROOKLYN TECHNICAL HIGH SCHOOL', 4561.0),
 ('FORT HAMILTON HIGH SCHOOL', 3888.0),
 ('FRANCIS LEWIS HIGH SCHOOL', 3623.0),
 ('MIDWOOD HIGH SCHOOL', 3234.0),
 ('JAMES MADISON HIGH SCHOOL', 3139.0)]

In [39]:
statement ="""
SELECT
  hs.boro,
  SUM(hs.total_students) - SUM(sr.num_test_takers) AS difference
FROM 
  high_schools hs
JOIN 
  sat_records sr ON hs.dbn = sr.dbn
GROUP BY 
  hs.boro
ORDER BY 
  difference ASC;
"""

run_query(db_path, statement)

[('R', 15627.0),
 ('X', 39112.0),
 ('M', 45460.0),
 ('Q', 61834.0),
 ('K', 64609.0)]

### Write the functions in a class

In [44]:
import sqlite3
import pandas as pd
from functools import wraps

def check_connection(func):
    """Decorator to check if the database connection is established."""
    @wraps(func)
    def wrapper(self, *args, **kwargs):
        if self.db_connect():
            return func(self, *args, **kwargs)
        else:
            raise ConnectionError("Failed to connect to the database.")
    return wrapper

class SchoolDatabase:
    def __init__(self, db_path: str):
        self.db_path = db_path
        
    def db_connect(self):
        """Creates a database connection."""
        try:
            conn = sqlite3.connect(self.db_path)
            print("Database connection successful.")
            return conn
        except sqlite3.Error as e:
            print(f'Database connection failed: {e}')
            return None
    
    @check_connection
    def load_data_to_sqlite(self, data_url:str, table_name: str) -> None:
        """
        Loads data from a CSV URL into an SQLite table.
        """
        conn = None
        try:
            conn = self.db_connect()
            if conn is not None:
                df = pd.read_csv(data_url)
                df.to_sql(table_name, conn, index=False, if_exists='replace')
                print(f"Data loaded successfully into '{table_name}' table.")
            else:
                print(f"Failed to load data into '{table_name}' table due to connection error.")
        except sqlite3.Error as e:
            print(f"An error occurred while loading data into '{table_name}': {e}")
        finally:
            if conn:
                conn.close()
           
    def get_table_info(self, table_name: str) -> list:
        """
        Retrieves the schema information of a given table.
        """
        conn = None
        try:
            conn = self.db_connect()
            cursor = conn.cursor()
            cursor.execute(f'PRAGMA table_info({table_name})')
            info = cursor.fetchall()
            print(f"Table info for '{table_name}' retrieved successfully.")
            return info
        except sqlite3.Error as e:
            print(f"An error occurred while retrieving info for '{table_name}': {e}")
        finally:
            if conn:
                conn.close()
    
    def get_table_info(self, table_name: str) -> list[type]:
        """
        Retrieves the schema information of a given table.
        """
        try:
            conn = self.db_connect()
            if conn is not None:
                cursor = conn.cursor()
                cursor.execute(f'PRAGMA table_info({table_name})')
                info = cursor.fetchall()
                print(f"Table info for '{table_name}' retrieved successfully.")
                return info
            else:
                print(f"Failed to retrieve info for '{table_name}' due to connection error.")
        except Exception as e:
            print(f"An error occurred while retrieving info for '{table_name}': {e}")
        finally:
            if conn:
                conn.close()
                 
    def run_query(self, statement: str) -> list:
        """Executes a SQL statement and returns the results."""
        conn = None
        try:
            conn = self.db_connect()
            cursor = conn.cursor()
            cursor.execute(statement)
            results = cursor.fetchall()
            print("Query executed successfully.")
            return results
        except sqlite3.Error as e:
            print(f"An error occurred while executing the query: {e}")
        finally:
            if conn:
                conn.close()

    
      def get_difference_between_students_and_test_takers(self) -> list[type]:
        """Calculates the difference between total students and number of test takers for each boro."""
        statement = """
        SELECT 
          hs.boro,
          SUM(hs.total_students) - SUM(sr.num_test_takers) AS difference
        FROM 
          high_schools hs
        JOIN 
          sat_records sr ON hs.dbn = sr.dbn
        GROUP BY 
          hs.boro
        ORDER BY 
          difference ASC;
        """
        try:
            results = self.run_query(statement)
            print("Successfully retrieved the difference between total students and number of test takers for each boro.")
            return results
        except Exception as e:
            print(f"An error occurred while calculating the difference: {e}")
            return []

In [45]:
# Usage
db = SchoolDatabase('schools.db')
db.load_data_to_sqlite(highschools_url, 'high_schools')
db.load_data_to_sqlite(sat_records_url, 'sat_records')

In [47]:
#print(db.get_table_info('high_schools'))
db.get_table_names()

[('high_schools',), ('sat_records',)]

In [50]:
# Find the top five schools that have the largest differences between num_test_takers and total_students

statement = """
SELECT 
  name,
  max(high_schools.total_students - sat_records.num_test_takers ) 
FROM sat_records
JOIN high_schools 
  on sat_records.dbn = high_schools.dbn
GROUP BY 
  sat_records.dbn
ORDER BY 
  max(high_schools.total_students - sat_records.num_test_takers ) desc
LIMIT 5
"""
db.run_query(statement)

[('BROOKLYN TECHNICAL HIGH SCHOOL', 4561.0),
 ('FORT HAMILTON HIGH SCHOOL', 3888.0),
 ('FRANCIS LEWIS HIGH SCHOOL', 3623.0),
 ('MIDWOOD HIGH SCHOOL', 3234.0),
 ('JAMES MADISON HIGH SCHOOL', 3139.0)]

In [57]:
records = db.run_query(statement)
new_records = []
for schoolname, diff_num in records:
    if diff_num >= 3500:
        new_records.append({schoolname: diff_num})
    
new_records

[{'BROOKLYN TECHNICAL HIGH SCHOOL': 4561.0},
 {'FORT HAMILTON HIGH SCHOOL': 3888.0},
 {'FRANCIS LEWIS HIGH SCHOOL': 3623.0}]